#+title:      A Klasse 2024-28
#+date:       [2024-09-08 So 21:40]
#+filetags:   :1a:
#+identifier: 20240908T214000
#+LANGUAGE: de
#+BIBLIOGRAPHY: ~/RoamNotes/references/Literatur.bib
#+SETUPFILE: ~/RoamNotes/config/latex_setup.org
#+ATTR_LATEX: :environment tabularx :placement [h] :center t :width linewidth
#+OPTIONS: num:nil toc:nil
#+STARTUP: fnadjust
#+STARTUP: showall
#+export_file_name: ~/RoamNotes/exports/1a.html

* Jahresplanung
[[denote:20240719T125948][Jahresplanung 01]]

* Lernschiene
[[file:~/OneDrive/Dokumente/Religion_Lernschiene/]]

* Stundenplanung

** Einführung
Persönliche Vorstellung; Bücher austeilen!

Gemeinsames Lied.

** Wiederholung
Wie war RU?

** Themen
Sollten diese Themen zu "abstrakt" sein - vielleicht mit einem eher typischen RU Thema beginnen, wie das Leben Jesu?

[[denote:20240911T093358][Die Welt der Gefühle]]

[[denote:20240911T093423][Was ich mir zutraue]]

Jesusquiz

** Hefteintrag
Arbeitsweg 1 - 4

http://www.veritas.at/code (rfu300)

* Schülerliste
#+Name: 2021-students
|----------+--------------+---------------------+------+-----------+------+-----|
| First    | Last         | Name                | Note | Mitarbeit | Heft | LZK |
|----------+--------------+---------------------+------+-----------+------+-----|
| Sophie   | Auer         | [[Sophie Auer][Sophie Auer]]         |    0 |           |      |     |
| Matthias | Buchegger    | [[Matthias Buchegger][Matthias Buchegger]]  |    0 |           |      |     |
| Felix    | Eder         | [[Felix Eder][Felix Eder]]          |    0 |           |      |     |
| Samuel   | Hirscher     | [[Samuel Hirscher][Samuel Hirscher]]     |    0 |           |      |     |
| Anna     | Kainhofer    | [[Anna Kainhofer][Anna Kainhofer]]      |    0 |           |      |     |
| Ilvy     | Ramsauer     | [[Ilvy Ramsauer][Ilvy Ramsauer]]       |    0 |           |      |     |
| Nadine   | Ramsauer     | [[Nadine Ramsauer][Nadine Ramsauer]]     |    0 |           |      |     |
| Leonie   | Reschreiter  | [[Leonie Reschreiter][Leonie Reschreiter]]  |    0 |           |      |     |
| Tobias   | Rettenbacher | [[Tobias Rettenbacher][Tobias Rettenbacher]] |    0 |           |      |     |
| Jakob    | Rettenegger  | [[Jakob Rettenegger][Jakob Rettenegger]]   |    0 |           |      |     |
| Eva      | Schlager     | [[Eva Schlager][Eva Schlager]]        |    0 |           |      |     |
| Tim      | Schledt      | [[Tim Schledt][Tim Schledt]]         |    0 |           |      |     |
| Ella     | Sunkler      | [[Ella Sunkler][Ella Sunkler]]        |    0 |           |      |     |
| Finja    | Thomüller    | [[Finja Thomüller][Finja Thomüller]]     |    0 |           |      |     |
| Julia    | Windhofer    | [[Julia Windhofer][Julia Windhofer]]     |    0 |           |      |     |
|----------+--------------+---------------------+------+-----------+------+-----|
#+TBLFM: $4=vmean($5..$>);%.0f
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $5='(identity remote(Mitarbeit,@@#$2))

#+BIND: org-export-filter-timestamp-functions (tmp-f-timestamp)
#+BIND: org-export-filter-strike-through-functions (tmp-f-strike-through)
#+BEGIN_SRC emacs-lisp :exports results :results none
  (defun tmp-f-timestamp (s backend info)
    (replace-regexp-in-string "&[lg]t;\\|[][]" "" s))
  (defun tmp-f-strike-through (s backend info) "")
#+END_SRC


#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = last + '.' + first + '@abtenau.schule'
      print('** ' + first + ' ' + last + '')
      print(':PROPERTIES:')
      print(':EMAIL: ' '[[mailto: ' + last + ' ' + first + ' <' + email + '>]]')
      print(':EXPORT_FILE_NAME: ' '~/RoamNotes/exports/'  + first +  '_'  + last +  '.html')
      print(':ID: ' + first + '' + last + '')
      print(':END: ')
      print('#+Name: Note_' + first + '' + last + '')
      print('|-----------------------+-------+-------------+-----+-----------+------------|')
      print('| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |')
      print('|-----------------------+-------+-------------+-----+-----------+------------|')
      print('|                       |       |             |     |           |            |')
      print('#+TBLFM: $6=vmean($3..$5);%.0f')
      print('\n')
#+END_SRC

#+RESULTS:
* Mitarbeit

** Sophie Auer
:PROPERTIES:
:EMAIL: [[mailto: Auer Sophie <Auer.Sophie@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Sophie_Auer.html
:ID: SophieAuer
:END: 
#+Name: Note_SophieAuer
|-----------------------+-------+-------------+-----+-----------+------------|
| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |
|-----------------------+-------+-------------+-----+-----------+------------|
|                       |       |             |     |           |            |
#+TBLFM: $6=vmean($3..$5);%.0f


** Matthias Buchegger
:PROPERTIES:
:EMAIL: [[mailto: Buchegger Matthias <Buchegger.Matthias@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Matthias_Buchegger.html
:ID: MatthiasBuchegger
:END: 
#+Name: Note_MatthiasBuchegger
|-----------------------+-------+-------------+-----+-----------+------------|
| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |
|-----------------------+-------+-------------+-----+-----------+------------|
|                       |       |             |     |           |            |
#+TBLFM: $6=vmean($3..$5);%.0f


** Felix Eder
:PROPERTIES:
:EMAIL: [[mailto: Eder Felix <Eder.Felix@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Felix_Eder.html
:ID: FelixEder
:END: 
#+Name: Note_FelixEder
|-----------------------+-------+-------------+-----+-----------+------------|
| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |
|-----------------------+-------+-------------+-----+-----------+------------|
|                       |       |             |     |           |            |
#+TBLFM: $6=vmean($3..$5);%.0f


** Samuel Hirscher
:PROPERTIES:
:EMAIL: [[mailto: Hirscher Samuel <Hirscher.Samuel@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Samuel_Hirscher.html
:ID: SamuelHirscher
:END: 
#+Name: Note_SamuelHirscher
|-----------------------+-------+-------------+-----+-----------+------------|
| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |
|-----------------------+-------+-------------+-----+-----------+------------|
|                       |       |             |     |           |            |
#+TBLFM: $6=vmean($3..$5);%.0f


** Anna Kainhofer
:PROPERTIES:
:EMAIL: [[mailto: Kainhofer Anna <Kainhofer.Anna@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Anna_Kainhofer.html
:ID: AnnaKainhofer
:END: 
#+Name: Note_AnnaKainhofer
|-----------------------+-------+-------------+-----+-----------+------------|
| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |
|-----------------------+-------+-------------+-----+-----------+------------|
|                       |       |             |     |           |            |
#+TBLFM: $6=vmean($3..$5);%.0f


** Ilvy Ramsauer
:PROPERTIES:
:EMAIL: [[mailto: Ramsauer Ilvy <Ramsauer.Ilvy@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Ilvy_Ramsauer.html
:ID: IlvyRamsauer
:END: 
#+Name: Note_IlvyRamsauer
|-----------------------+-------+-------------+-----+-----------+------------|
| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |
|-----------------------+-------+-------------+-----+-----------+------------|
|                       |       |             |     |           |            |
#+TBLFM: $6=vmean($3..$5);%.0f


** Nadine Ramsauer
:PROPERTIES:
:EMAIL: [[mailto: Ramsauer Nadine <Ramsauer.Nadine@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Nadine_Ramsauer.html
:ID: NadineRamsauer
:END: 
#+Name: Note_NadineRamsauer
|-----------------------+-------+-------------+-----+-----------+------------|
| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |
|-----------------------+-------+-------------+-----+-----------+------------|
|                       |       |             |     |           |            |
#+TBLFM: $6=vmean($3..$5);%.0f


** Leonie Reschreiter
:PROPERTIES:
:EMAIL: [[mailto: Reschreiter Leonie <Reschreiter.Leonie@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Leonie_Reschreiter.html
:ID: LeonieReschreiter
:END: 
#+Name: Note_LeonieReschreiter
|-----------------------+-------+-------------+-----+-----------+------------|
| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |
|-----------------------+-------+-------------+-----+-----------+------------|
|                       |       |             |     |           |            |
#+TBLFM: $6=vmean($3..$5);%.0f


** Tobias Rettenbacher
:PROPERTIES:
:EMAIL: [[mailto: Rettenbacher Tobias <Rettenbacher.Tobias@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Tobias_Rettenbacher.html
:ID: TobiasRettenbacher
:END: 
#+Name: Note_TobiasRettenbacher
|-----------------------+-------+-------------+-----+-----------+------------|
| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |
|-----------------------+-------+-------------+-----+-----------+------------|
|                       |       |             |     |           |            |
#+TBLFM: $6=vmean($3..$5);%.0f


** Jakob Rettenegger
:PROPERTIES:
:EMAIL: [[mailto: Rettenegger Jakob <Rettenegger.Jakob@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Jakob_Rettenegger.html
:ID: JakobRettenegger
:END: 
#+Name: Note_JakobRettenegger
|-----------------------+-------+-------------+-----+-----------+------------|
| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |
|-----------------------+-------+-------------+-----+-----------+------------|
|                       |       |             |     |           |            |
#+TBLFM: $6=vmean($3..$5);%.0f


** Eva Schlager
:PROPERTIES:
:EMAIL: [[mailto: Schlager Eva <Schlager.Eva@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Eva_Schlager.html
:ID: EvaSchlager
:END: 
#+Name: Note_EvaSchlager
|-----------------------+-------+-------------+-----+-----------+------------|
| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |
|-----------------------+-------+-------------+-----+-----------+------------|
|                       |       |             |     |           |            |
#+TBLFM: $6=vmean($3..$5);%.0f


** Tim Schledt
:PROPERTIES:
:EMAIL: [[mailto: Schledt Tim <Schledt.Tim@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Tim_Schledt.html
:ID: TimSchledt
:END: 
#+Name: Note_TimSchledt
|-----------------------+-------+-------------+-----+-----------+------------|
| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |
|-----------------------+-------+-------------+-----+-----------+------------|
|                       |       |             |     |           |            |
#+TBLFM: $6=vmean($3..$5);%.0f


** Ella Sunkler
:PROPERTIES:
:EMAIL: [[mailto: Sunkler Ella <Sunkler.Ella@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Ella_Sunkler.html
:ID: EllaSunkler
:END: 
#+Name: Note_EllaSunkler
|-----------------------+-------+-------------+-----+-----------+------------|
| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |
|-----------------------+-------+-------------+-----+-----------+------------|
|                       |       |             |     |           |            |
#+TBLFM: $6=vmean($3..$5);%.0f


** Finja Thomüller
:PROPERTIES:
:EMAIL: [[mailto: Thomüller Finja <Thomüller.Finja@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Finja_Thomüller.html
:ID: FinjaThomüller
:END: 
#+Name: Note_FinjaThomüller
|-----------------------+-------+-------------+-----+-----------+------------|
| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |
|-----------------------+-------+-------------+-----+-----------+------------|
|                       |       |             |     |           |            |
#+TBLFM: $6=vmean($3..$5);%.0f


** Julia Windhofer
:PROPERTIES:
:EMAIL: [[mailto: Windhofer Julia <Windhofer.Julia@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Julia_Windhofer.html
:ID: JuliaWindhofer
:END: 
#+Name: Note_JuliaWindhofer
|-----------------------+-------+-------------+-----+-----------+------------|
| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |
|-----------------------+-------+-------------+-----+-----------+------------|
|                       |       |             |     |           |            |
#+TBLFM: $6=vmean($3..$5);%.0f


